HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEray_regdef.h
/** \brief New Data Register 3 */
typedef struct _Ifx_ERAY_NDAT3_Bits
{
    Ifx_UReg_32Bit ND64:1;            /**< \brief [0:0] New Data 64 (n = 64-95) - ND64 (rh) */
    Ifx_UReg_32Bit ND65:1;            /**< \brief [1:1] New Data 65 (n = 64-95) - ND65 (rh) */
    Ifx_UReg_32Bit ND66:1;            /**< \brief [2:2] New Data 66 (n = 64-95) - ND66 (rh) */
    Ifx_UReg_32Bit ND67:1;            /**< \brief [3:3] New Data 67 (n = 64-95) - ND67 (rh) */
    Ifx_UReg_32Bit ND68:1;            /**< \brief [4:4] New Data 68 (n = 64-95) - ND68 (rh) */
    Ifx_UReg_32Bit ND69:1;            /**< \brief [5:5] New Data 69 (n = 64-95) - ND69 (rh) */
    Ifx_UReg_32Bit ND70:1;            /**< \brief [6:6] New Data 70 (n = 64-95) - ND70 (rh) */
    Ifx_UReg_32Bit ND71:1;            /**< \brief [7:7] New Data 71 (n = 64-95) - ND71 (rh) */
    Ifx_UReg_32Bit ND72:1;            /**< \brief [8:8] New Data 72 (n = 64-95) - ND72 (rh) */
    Ifx_UReg_32Bit ND73:1;            /**< \brief [9:9] New Data 73 (n = 64-95) - ND73 (rh) */
    Ifx_UReg_32Bit ND74:1;            /**< \brief [10:10] New Data 74 (n = 64-95) - ND74 (rh) */
    Ifx_UReg_32Bit ND75:1;            /**< \brief [11:11] New Data 75 (n = 64-95) - ND75 (rh) */
    Ifx_UReg_32Bit ND76:1;            /**< \brief [12:12] New Data 76 (n = 64-95) - ND76 (rh) */
    Ifx_UReg_32Bit ND77:1;            /**< \brief [13:13] New Data 77 (n = 64-95) - ND77 (rh) */
    Ifx_UReg_32Bit ND78:1;            /**< \brief [14:14] New Data 78 (n = 64-95) - ND78 (rh) */
    Ifx_UReg_32Bit ND79:1;            /**< \brief [15:15] New Data 79 (n = 64-95) - ND79 (rh) */
    Ifx_UReg_32Bit ND80:1;            /**< \brief [16:16] New Data 80 (n = 64-95) - ND80 (rh) */
    Ifx_UReg_32Bit ND81:1;            /**< \brief [17:17] New Data 81 (n = 64-95) - ND81 (rh) */
    Ifx_UReg_32Bit ND82:1;            /**< \brief [18:18] New Data 82 (n = 64-95) - ND82 (rh) */
    Ifx_UReg_32Bit ND83:1;            /**< \brief [19:19] New Data 83 (n = 64-95) - ND83 (rh) */
    Ifx_UReg_32Bit ND84:1;            /**< \brief [20:20] New Data 84 (n = 64-95) - ND84 (rh) */
    Ifx_UReg_32Bit ND85:1;            /**< \brief [21:21] New Data 85 (n = 64-95) - ND85 (rh) */
    Ifx_UReg_32Bit ND86:1;            /**< \brief [22:22] New Data 86 (n = 64-95) - ND86 (rh) */
    Ifx_UReg_32Bit ND87:1;            /**< \brief [23:23] New Data 87 (n = 64-95) - ND87 (rh) */
    Ifx_UReg_32Bit ND88:1;            /**< \brief [24:24] New Data 88 (n = 64-95) - ND88 (rh) */
    Ifx_UReg_32Bit ND89:1;            /**< \brief [25:25] New Data 89 (n = 64-95) - ND89 (rh) */
    Ifx_UReg_32Bit ND90:1;            /**< \brief [26:26] New Data 90 (n = 64-95) - ND90 (rh) */
    Ifx_UReg_32Bit ND91:1;            /**< \brief [27:27] New Data 91 (n = 64-95) - ND91 (rh) */
    Ifx_UReg_32Bit ND92:1;            /**< \brief [28:28] New Data 92 (n = 64-95) - ND92 (rh) */
    Ifx_UReg_32Bit ND93:1;            /**< \brief [29:29] New Data 93 (n = 64-95) - ND93 (rh) */
    Ifx_UReg_32Bit ND94:1;            /**< \brief [30:30] New Data 94 (n = 64-95) - ND94 (rh) */
    Ifx_UReg_32Bit ND95:1;            /**< \brief [31:31] New Data 95 (n = 64-95) - ND95 (rh) */
} Ifx_ERAY_NDAT3_Bits;

/** \brief New Data Register 4 */
typedef struct _Ifx_ERAY_NDAT4_Bits
{
    Ifx_UReg_32Bit ND96:1;            /**< \brief [0:0] New Data 96 (n = 96-127) - ND96 (rh) */
    Ifx_UReg_32Bit ND97:1;            /**< \brief [1:1] New Data 97 (n = 96-127) - ND97 (rh) */
    Ifx_UReg_32Bit ND98:1;            /**< \brief [2:2] New Data 98 (n = 96-127) - ND98 (rh) */
    Ifx_UReg_32Bit ND99:1;            /**< \brief [3:3] New Data 99 (n = 96-127) - ND99 (rh) */
    Ifx_UReg_32Bit ND100:1;           /**< \brief [4:4] New Data 100 (n = 96-127) - ND100 (rh) */
    Ifx_UReg_32Bit ND101:1;           /**< \brief [5:5] New Data 101 (n = 96-127) - ND101 (rh) */
    Ifx_UReg_32Bit ND102:1;           /**< \brief [6:6] New Data 102 (n = 96-127) - ND102 (rh) */
    Ifx_UReg_32Bit ND103:1;           /**< \brief [7:7] New Data 103 (n = 96-127) - ND103 (rh) */
    Ifx_UReg_32Bit ND104:1;           /**< \brief [8:8] New Data 104 (n = 96-127) - ND104 (rh) */
    Ifx_UReg_32Bit ND105:1;           /**< \brief [9:9] New Data 105 (n = 96-127) - ND105 (rh) */
    Ifx_UReg_32Bit ND106:1;           /**< \brief [10:10] New Data 106 (n = 96-127) - ND106 (rh) */
    Ifx_UReg_32Bit ND107:1;           /**< \brief [11:11] New Data 107 (n = 96-127) - ND107 (rh) */
    Ifx_UReg_32Bit ND108:1;           /**< \brief [12:12] New Data 108 (n = 96-127) - ND108 (rh) */
    Ifx_UReg_32Bit ND109:1;           /**< \brief [13:13] New Data 109 (n = 96-127) - ND109 (rh) */
    Ifx_UReg_32Bit ND110:1;           /**< \brief [14:14] New Data 110 (n = 96-127) - ND110 (rh) */
    Ifx_UReg_32Bit ND111:1;           /**< \brief [15:15] New Data 111 (n = 96-127) - ND111 (rh) */
    Ifx_UReg_32Bit ND112:1;           /**< \brief [16:16] New Data 112 (n = 96-127) - ND112 (rh) */
    Ifx_UReg_32Bit ND113:1;           /**< \brief [17:17] New Data 113 (n = 96-127) - ND113 (rh) */
    Ifx_UReg_32Bit ND114:1;           /**< \brief [18:18] New Data 114 (n = 96-127) - ND114 (rh) */
    Ifx_UReg_32Bit ND115:1;           /**< \brief [19:19] New Data 115 (n = 96-127) - ND115 (rh) */
    Ifx_UReg_32Bit ND116:1;           /**< \brief [20:20] New Data 116 (n = 96-127) - ND116 (rh) */
    Ifx_UReg_32Bit ND117:1;           /**< \brief [21:21] New Data 117 (n = 96-127) - ND117 (rh) */
    Ifx_UReg_32Bit ND118:1;           /**< \brief [22:22] New Data 118 (n = 96-127) - ND118 (rh) */
    Ifx_UReg_32Bit ND119:1;           /**< \brief [23:23] New Data 119 (n = 96-127) - ND119 (rh) */
    Ifx_UReg_32Bit ND120:1;           /**< \brief [24:24] New Data 120 (n = 96-127) - ND120 (rh) */
    Ifx_UReg_32Bit ND121:1;           /**< \brief [25:25] New Data 121 (n = 96-127) - ND121 (rh) */
    Ifx_UReg_32Bit ND122:1;           /**< \brief [26:26] New Data 122 (n = 96-127) - ND122 (rh) */
    Ifx_UReg_32Bit ND123:1;           /**< \brief [27:27] New Data 123 (n = 96-127) - ND123 (rh) */
    Ifx_UReg_32Bit ND124:1;           /**< \brief [28:28] New Data 124 (n = 96-127) - ND124 (rh) */
    Ifx_UReg_32Bit ND125:1;           /**< \brief [29:29] New Data 125 (n = 96-127) - ND125 (rh) */
    Ifx_UReg_32Bit ND126:1;           /**< \brief [30:30] New Data 126 (n = 96-127) - ND126 (rh) */
    Ifx_UReg_32Bit ND127:1;           /**< \brief [31:31] New Data 127 (n = 96-127) - ND127 (rh) */
} Ifx_ERAY_NDAT4_Bits;

/** \brief New Data Interrupt Control 1 */
typedef struct _Ifx_ERAY_NDIC1_Bits
{
    Ifx_UReg_32Bit NDIP0:1;           /**< \brief [0:0] New Data Interrupt Pointer 0 (n = 0-31) - NDIP0 (rw) */
    Ifx_UReg_32Bit NDIP1:1;           /**< \brief [1:1] New Data Interrupt Pointer 1 (n = 0-31) - NDIP1 (rw) */
    Ifx_UReg_32Bit NDIP2:1;           /**< \brief [2:2] New Data Interrupt Pointer 2 (n = 0-31) - NDIP2 (rw) */
    Ifx_UReg_32Bit NDIP3:1;           /**< \brief [3:3] New Data Interrupt Pointer 3 (n = 0-31) - NDIP3 (rw) */
    Ifx_UReg_32Bit NDIP4:1;           /**< \brief [4:4] New Data Interrupt Pointer 4 (n = 0-31) - NDIP4 (rw) */
    Ifx_UReg_32Bit NDIP5:1;           /**< \brief [5:5] New Data Interrupt Pointer 5 (n = 0-31) - NDIP5 (rw) */
    Ifx_UReg_32Bit NDIP6:1;           /**< \brief [6:6] New Data Interrupt Pointer 6 (n = 0-31) - NDIP6 (rw) */
    Ifx_UReg_32Bit NDIP7:1;           /**< \brief [7:7] New Data Interrupt Pointer 7 (n = 0-31) - NDIP7 (rw) */
    Ifx_UReg_32Bit NDIP8:1;           /**< \brief [8:8] New Data Interrupt Pointer 8 (n = 0-31) - NDIP8 (rw) */
    Ifx_UReg_32Bit NDIP9:1;           /**< \brief [9:9] New Data Interrupt Pointer 9 (n = 0-31) - NDIP9 (rw) */
    Ifx_UReg_32Bit NDIP10:1;          /**< \brief [10:10] New Data Interrupt Pointer 10 (n = 0-31) - NDIP10 (rw) */
    Ifx_UReg_32Bit NDIP11:1;          /**< \brief [11:11] New Data Interrupt Pointer 11 (n = 0-31) - NDIP11 (rw) */
    Ifx_UReg_32Bit NDIP12:1;          /**< \brief [12:12] New Data Interrupt Pointer 12 (n = 0-31) - NDIP12 (rw) */
    Ifx_UReg_32Bit NDIP13:1;          /**< \brief [13:13] New Data Interrupt Pointer 13 (n = 0-31) - NDIP13 (rw) */
    Ifx_UReg_32Bit NDIP14:1;          /**< \brief [14:14] New Data Interrupt Pointer 14 (n = 0-31) - NDIP14 (rw) */
    Ifx_UReg_32Bit NDIP15:1;          /**< \brief [15:15] New Data Interrupt Pointer 15 (n = 0-31) - NDIP15 (rw) */
    Ifx_UReg_32Bit NDIP16:1;          /**< \brief [16:16] New Data Interrupt Pointer 16 (n = 0-31) - NDIP16 (rw) */
    Ifx_UReg_32Bit NDIP17:1;          /**< \brief [17:17] New Data Interrupt Pointer 17 (n = 0-31) - NDIP17 (rw) */
    Ifx_UReg_32Bit NDIP18:1;          /**< \brief [18:18] New Data Interrupt Pointer 18 (n = 0-31) - NDIP18 (rw) */
    Ifx_UReg_32Bit NDIP19:1;          /**< \brief [19:19] New Data Interrupt Pointer 19 (n = 0-31) - NDIP19 (rw) */
    Ifx_UReg_32Bit NDIP20:1;          /**< \brief [20:20] New Data Interrupt Pointer 20 (n = 0-31) - NDIP20 (rw) */
    Ifx_UReg_32Bit NDIP21:1;          /**< \brief [21:21] New Data Interrupt Pointer 21 (n = 0-31) - NDIP21 (rw) */
    Ifx_UReg_32Bit NDIP22:1;          /**< \brief [22:22] New Data Interrupt Pointer 22 (n = 0-31) - NDIP22 (rw) */
    Ifx_UReg_32Bit NDIP23:1;          /**< \brief [23:23] New Data Interrupt Pointer 23 (n = 0-31) - NDIP23 (rw) */
    Ifx_UReg_32Bit NDIP24:1;          /**< \brief [24:24] New Data Interrupt Pointer 24 (n = 0-31) - NDIP24 (rw) */
    Ifx_UReg_32Bit NDIP25:1;          /**< \brief [25:25] New Data Interrupt Pointer 25 (n = 0-31) - NDIP25 (rw) */
    Ifx_UReg_32Bit NDIP26:1;          /**< \brief [26:26] New Data Interrupt Pointer 26 (n = 0-31) - NDIP26 (rw) */
    Ifx_UReg_32Bit NDIP27:1;          /**< \brief [27:27] New Data Interrupt Pointer 27 (n = 0-31) - NDIP27 (rw) */
    Ifx_UReg_32Bit NDIP28:1;          /**< \brief [28:28] New Data Interrupt Pointer 28 (n = 0-31) - NDIP28 (rw) */
    Ifx_UReg_32Bit NDIP29:1;          /**< \brief [29:29] New Data Interrupt Pointer 29 (n = 0-31) - NDIP29 (rw) */
    Ifx_UReg_32Bit NDIP30:1;          /**< \brief [30:30] New Data Interrupt Pointer 30 (n = 0-31) - NDIP30 (rw) */
    Ifx_UReg_32Bit NDIP31:1;          /**< \brief [31:31] New Data Interrupt Pointer 31 (n = 0-31) - NDIP31 (rw) */
} Ifx_ERAY_NDIC1_Bits;

/** \brief New Data Interrupt Control 2 */
typedef struct _Ifx_ERAY_NDIC2_Bits
{
    Ifx_UReg_32Bit NDIP32:1;          /**< \brief [0:0] New Data Interrupt Pointer 32 (n = 32-63) - NDIP32 (rw) */
    Ifx_UReg_32Bit NDIP33:1;          /**< \brief [1:1] New Data Interrupt Pointer 33 (n = 32-63) - NDIP33 (rw) */
    Ifx_UReg_32Bit NDIP34:1;          /**< \brief [2:2] New Data Interrupt Pointer 34 (n = 32-63) - NDIP34 (rw) */
    Ifx_UReg_32Bit NDIP35:1;          /**< \brief [3:3] New Data Interrupt Pointer 35 (n = 32-63) - NDIP35 (rw) */
    Ifx_UReg_32Bit NDIP36:1;          /**< \brief [4:4] New Data Interrupt Pointer 36 (n = 32-63) - NDIP36 (rw) */
    Ifx_UReg_32Bit NDIP37:1;          /**< \brief [5:5] New Data Interrupt Pointer 37 (n = 32-63) - NDIP37 (rw) */
    Ifx_UReg_32Bit NDIP38:1;          /**< \brief [6:6] New Data Interrupt Pointer 38 (n = 32-63) - NDIP38 (rw) */
    Ifx_UReg_32Bit NDIP39:1;          /**< \brief [7:7] New Data Interrupt Pointer 39 (n = 32-63) - NDIP39 (rw) */
    Ifx_UReg_32Bit NDIP40:1;          /**< \brief [8:8] New Data Interrupt Pointer 40 (n = 32-63) - NDIP40 (rw) */
    Ifx_UReg_32Bit NDIP41:1;          /**< \brief [9:9] New Data Interrupt Pointer 41 (n = 32-63) - NDIP41 (rw) */
    Ifx_UReg_32Bit NDIP42:1;          /**< \brief [10:10] New Data Interrupt Pointer 42 (n = 32-63) - NDIP42 (rw) */
    Ifx_UReg_32Bit NDIP43:1;          /**< \brief [11:11] New Data Interrupt Pointer 43 (n = 32-63) - NDIP43 (rw) */
    Ifx_UReg_32Bit NDIP44:1;          /**< \brief [12:12] New Data Interrupt Pointer 44 (n = 32-63) - NDIP44 (rw) */
    Ifx_UReg_32Bit NDIP45:1;          /**< \brief [13:13] New Data Interrupt Pointer 45 (n = 32-63) - NDIP45 (rw) */
    Ifx_UReg_32Bit NDIP46:1;          /**< \brief [14:14] New Data Interrupt Pointer 46 (n = 32-63) - NDIP46 (rw) */
    Ifx_UReg_32Bit NDIP47:1;          /**< \brief [15:15] New Data Interrupt Pointer 47 (n = 32-63) - NDIP47 (rw) */
    Ifx_UReg_32Bit NDIP48:1;          /**< \brief [16:16] New Data Interrupt Pointer 48 (n = 32-63) - NDIP48 (rw) */
    Ifx_UReg_32Bit NDIP49:1;          /**< \brief [17:17] New Data Interrupt Pointer 49 (n = 32-63) - NDIP49 (rw) */
    Ifx_UReg_32Bit NDIP50:1;          /**< \brief [18:18] New Data Interrupt Pointer 50 (n = 32-63) - NDIP50 (rw) */
    Ifx_UReg_32Bit NDIP51:1;          /**< \brief [19:19] New Data Interrupt Pointer 51 (n = 32-63) - NDIP51 (rw) */
    Ifx_UReg_32Bit NDIP52:1;          /**< \brief [20:20] New Data Interrupt Pointer 52 (n = 32-63) - NDIP52 (rw) */
    Ifx_UReg_32Bit NDIP53:1;          /**< \brief [21:21] New Data Interrupt Pointer 53 (n = 32-63) - NDIP53 (rw) */
    Ifx_UReg_32Bit NDIP54:1;          /**< \brief [22:22] New Data Interrupt Pointer 54 (n = 32-63) - NDIP54 (rw) */
    Ifx_UReg_32Bit NDIP55:1;          /**< \brief [23:23] New Data Interrupt Pointer 55 (n = 32-63) - NDIP55 (rw) */
    Ifx_UReg_32Bit NDIP56:1;          /**< \brief [24:24] New Data Interrupt Pointer 56 (n = 32-63) - NDIP56 (rw) */
    Ifx_UReg_32Bit NDIP57:1;          /**< \brief [25:25] New Data Interrupt Pointer 57 (n = 32-63) - NDIP57 (rw) */
    Ifx_UReg_32Bit NDIP58:1;          /**< \brief [26:26] New Data Interrupt Pointer 58 (n = 32-63) - NDIP58 (rw) */
    Ifx_UReg_32Bit NDIP59:1;          /**< \brief [27:27] New Data Interrupt Pointer 59 (n = 32-63) - NDIP59 (rw) */
    Ifx_UReg_32Bit NDIP60:1;          /**< \brief [28:28] New Data Interrupt Pointer 60 (n = 32-63) - NDIP60 (rw) */
    Ifx_UReg_32Bit NDIP61:1;          /**< \brief [29:29] New Data Interrupt Pointer 61 (n = 32-63) - NDIP61 (rw) */
    Ifx_UReg_32Bit NDIP62:1;          /**< \brief [30:30] New Data Interrupt Pointer 62 (n = 32-63) - NDIP62 (rw) */
    Ifx_UReg_32Bit NDIP63:1;          /**< \brief [31:31] New Data Interrupt Pointer 63 (n = 32-63) - NDIP63 (rw) */
} Ifx_ERAY_NDIC2_Bits;

