HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEray_regdef.h
/** \brief New Data Interrupt Control 3 */
typedef struct _Ifx_ERAY_NDIC3_Bits
{
    Ifx_UReg_32Bit NDIP64:1;          /**< \brief [0:0] New Data Interrupt Pointer 64 (n = 64-95) - NDIP64 (rw) */
    Ifx_UReg_32Bit NDIP65:1;          /**< \brief [1:1] New Data Interrupt Pointer 65 (n = 64-95) - NDIP65 (rw) */
    Ifx_UReg_32Bit NDIP66:1;          /**< \brief [2:2] New Data Interrupt Pointer 66 (n = 64-95) - NDIP66 (rw) */
    Ifx_UReg_32Bit NDIP67:1;          /**< \brief [3:3] New Data Interrupt Pointer 67 (n = 64-95) - NDIP67 (rw) */
    Ifx_UReg_32Bit NDIP68:1;          /**< \brief [4:4] New Data Interrupt Pointer 68 (n = 64-95) - NDIP68 (rw) */
    Ifx_UReg_32Bit NDIP69:1;          /**< \brief [5:5] New Data Interrupt Pointer 69 (n = 64-95) - NDIP69 (rw) */
    Ifx_UReg_32Bit NDIP70:1;          /**< \brief [6:6] New Data Interrupt Pointer 70 (n = 64-95) - NDIP70 (rw) */
    Ifx_UReg_32Bit NDIP71:1;          /**< \brief [7:7] New Data Interrupt Pointer 71 (n = 64-95) - NDIP71 (rw) */
    Ifx_UReg_32Bit NDIP72:1;          /**< \brief [8:8] New Data Interrupt Pointer 72 (n = 64-95) - NDIP72 (rw) */
    Ifx_UReg_32Bit NDIP73:1;          /**< \brief [9:9] New Data Interrupt Pointer 73 (n = 64-95) - NDIP73 (rw) */
    Ifx_UReg_32Bit NDIP74:1;          /**< \brief [10:10] New Data Interrupt Pointer 74 (n = 64-95) - NDIP74 (rw) */
    Ifx_UReg_32Bit NDIP75:1;          /**< \brief [11:11] New Data Interrupt Pointer 75 (n = 64-95) - NDIP75 (rw) */
    Ifx_UReg_32Bit NDIP76:1;          /**< \brief [12:12] New Data Interrupt Pointer 76 (n = 64-95) - NDIP76 (rw) */
    Ifx_UReg_32Bit NDIP77:1;          /**< \brief [13:13] New Data Interrupt Pointer 77 (n = 64-95) - NDIP77 (rw) */
    Ifx_UReg_32Bit NDIP78:1;          /**< \brief [14:14] New Data Interrupt Pointer 78 (n = 64-95) - NDIP78 (rw) */
    Ifx_UReg_32Bit NDIP79:1;          /**< \brief [15:15] New Data Interrupt Pointer 79 (n = 64-95) - NDIP79 (rw) */
    Ifx_UReg_32Bit NDIP80:1;          /**< \brief [16:16] New Data Interrupt Pointer 80 (n = 64-95) - NDIP80 (rw) */
    Ifx_UReg_32Bit NDIP81:1;          /**< \brief [17:17] New Data Interrupt Pointer 81 (n = 64-95) - NDIP81 (rw) */
    Ifx_UReg_32Bit NDIP82:1;          /**< \brief [18:18] New Data Interrupt Pointer 82 (n = 64-95) - NDIP82 (rw) */
    Ifx_UReg_32Bit NDIP83:1;          /**< \brief [19:19] New Data Interrupt Pointer 83 (n = 64-95) - NDIP83 (rw) */
    Ifx_UReg_32Bit NDIP84:1;          /**< \brief [20:20] New Data Interrupt Pointer 84 (n = 64-95) - NDIP84 (rw) */
    Ifx_UReg_32Bit NDIP85:1;          /**< \brief [21:21] New Data Interrupt Pointer 85 (n = 64-95) - NDIP85 (rw) */
    Ifx_UReg_32Bit NDIP86:1;          /**< \brief [22:22] New Data Interrupt Pointer 86 (n = 64-95) - NDIP86 (rw) */
    Ifx_UReg_32Bit NDIP87:1;          /**< \brief [23:23] New Data Interrupt Pointer 87 (n = 64-95) - NDIP87 (rw) */
    Ifx_UReg_32Bit NDIP88:1;          /**< \brief [24:24] New Data Interrupt Pointer 88 (n = 64-95) - NDIP88 (rw) */
    Ifx_UReg_32Bit NDIP89:1;          /**< \brief [25:25] New Data Interrupt Pointer 89 (n = 64-95) - NDIP89 (rw) */
    Ifx_UReg_32Bit NDIP90:1;          /**< \brief [26:26] New Data Interrupt Pointer 90 (n = 64-95) - NDIP90 (rw) */
    Ifx_UReg_32Bit NDIP91:1;          /**< \brief [27:27] New Data Interrupt Pointer 91 (n = 64-95) - NDIP91 (rw) */
    Ifx_UReg_32Bit NDIP92:1;          /**< \brief [28:28] New Data Interrupt Pointer 92 (n = 64-95) - NDIP92 (rw) */
    Ifx_UReg_32Bit NDIP93:1;          /**< \brief [29:29] New Data Interrupt Pointer 93 (n = 64-95) - NDIP93 (rw) */
    Ifx_UReg_32Bit NDIP94:1;          /**< \brief [30:30] New Data Interrupt Pointer 94 (n = 64-95) - NDIP94 (rw) */
    Ifx_UReg_32Bit NDIP95:1;          /**< \brief [31:31] New Data Interrupt Pointer 95 (n = 64-95) - NDIP95 (rw) */
} Ifx_ERAY_NDIC3_Bits;

/** \brief New Data Interrupt Control 4 */
typedef struct _Ifx_ERAY_NDIC4_Bits
{
    Ifx_UReg_32Bit NDIP96:1;          /**< \brief [0:0] New Data Interrupt Pointer 96 (n = 96-127) - NDIP96 (rw) */
    Ifx_UReg_32Bit NDIP97:1;          /**< \brief [1:1] New Data Interrupt Pointer 97 (n = 96-127) - NDIP97 (rw) */
    Ifx_UReg_32Bit NDIP98:1;          /**< \brief [2:2] New Data Interrupt Pointer 98 (n = 96-127) - NDIP98 (rw) */
    Ifx_UReg_32Bit NDIP99:1;          /**< \brief [3:3] New Data Interrupt Pointer 99 (n = 96-127) - NDIP99 (rw) */
    Ifx_UReg_32Bit NDIP100:1;         /**< \brief [4:4] New Data Interrupt Pointer 100 (n = 96-127) - NDIP100 (rw) */
    Ifx_UReg_32Bit NDIP101:1;         /**< \brief [5:5] New Data Interrupt Pointer 101 (n = 96-127) - NDIP101 (rw) */
    Ifx_UReg_32Bit NDIP102:1;         /**< \brief [6:6] New Data Interrupt Pointer 102 (n = 96-127) - NDIP102 (rw) */
    Ifx_UReg_32Bit NDIP103:1;         /**< \brief [7:7] New Data Interrupt Pointer 103 (n = 96-127) - NDIP103 (rw) */
    Ifx_UReg_32Bit NDIP104:1;         /**< \brief [8:8] New Data Interrupt Pointer 104 (n = 96-127) - NDIP104 (rw) */
    Ifx_UReg_32Bit NDIP105:1;         /**< \brief [9:9] New Data Interrupt Pointer 105 (n = 96-127) - NDIP105 (rw) */
    Ifx_UReg_32Bit NDIP106:1;         /**< \brief [10:10] New Data Interrupt Pointer 106 (n = 96-127) - NDIP106 (rw) */
    Ifx_UReg_32Bit NDIP107:1;         /**< \brief [11:11] New Data Interrupt Pointer 107 (n = 96-127) - NDIP107 (rw) */
    Ifx_UReg_32Bit NDIP108:1;         /**< \brief [12:12] New Data Interrupt Pointer 108 (n = 96-127) - NDIP108 (rw) */
    Ifx_UReg_32Bit NDIP109:1;         /**< \brief [13:13] New Data Interrupt Pointer 109 (n = 96-127) - NDIP109 (rw) */
    Ifx_UReg_32Bit NDIP110:1;         /**< \brief [14:14] New Data Interrupt Pointer 110 (n = 96-127) - NDIP110 (rw) */
    Ifx_UReg_32Bit NDIP111:1;         /**< \brief [15:15] New Data Interrupt Pointer 111 (n = 96-127) - NDIP111 (rw) */
    Ifx_UReg_32Bit NDIP112:1;         /**< \brief [16:16] New Data Interrupt Pointer 112 (n = 96-127) - NDIP112 (rw) */
    Ifx_UReg_32Bit NDIP113:1;         /**< \brief [17:17] New Data Interrupt Pointer 113 (n = 96-127) - NDIP113 (rw) */
    Ifx_UReg_32Bit NDIP114:1;         /**< \brief [18:18] New Data Interrupt Pointer 114 (n = 96-127) - NDIP114 (rw) */
    Ifx_UReg_32Bit NDIP115:1;         /**< \brief [19:19] New Data Interrupt Pointer 115 (n = 96-127) - NDIP115 (rw) */
    Ifx_UReg_32Bit NDIP116:1;         /**< \brief [20:20] New Data Interrupt Pointer 116 (n = 96-127) - NDIP116 (rw) */
    Ifx_UReg_32Bit NDIP117:1;         /**< \brief [21:21] New Data Interrupt Pointer 117 (n = 96-127) - NDIP117 (rw) */
    Ifx_UReg_32Bit NDIP118:1;         /**< \brief [22:22] New Data Interrupt Pointer 118 (n = 96-127) - NDIP118 (rw) */
    Ifx_UReg_32Bit NDIP119:1;         /**< \brief [23:23] New Data Interrupt Pointer 119 (n = 96-127) - NDIP119 (rw) */
    Ifx_UReg_32Bit NDIP120:1;         /**< \brief [24:24] New Data Interrupt Pointer 120 (n = 96-127) - NDIP120 (rw) */
    Ifx_UReg_32Bit NDIP121:1;         /**< \brief [25:25] New Data Interrupt Pointer 121 (n = 96-127) - NDIP121 (rw) */
    Ifx_UReg_32Bit NDIP122:1;         /**< \brief [26:26] New Data Interrupt Pointer 122 (n = 96-127) - NDIP122 (rw) */
    Ifx_UReg_32Bit NDIP123:1;         /**< \brief [27:27] New Data Interrupt Pointer 123 (n = 96-127) - NDIP123 (rw) */
    Ifx_UReg_32Bit NDIP124:1;         /**< \brief [28:28] New Data Interrupt Pointer 124 (n = 96-127) - NDIP124 (rw) */
    Ifx_UReg_32Bit NDIP125:1;         /**< \brief [29:29] New Data Interrupt Pointer 125 (n = 96-127) - NDIP125 (rw) */
    Ifx_UReg_32Bit NDIP126:1;         /**< \brief [30:30] New Data Interrupt Pointer 126 (n = 96-127) - NDIP126 (rw) */
    Ifx_UReg_32Bit NDIP127:1;         /**< \brief [31:31] New Data Interrupt Pointer 127 (n = 96-127) - NDIP127 (rw) */
} Ifx_ERAY_NDIC4_Bits;

/** \brief NEM Configuration Register */
typedef struct _Ifx_ERAY_NEMC_Bits
{
    Ifx_UReg_32Bit NML:4;             /**< \brief [3:0] Network Management Vector Length(gNetworkManagementVectorLength) - NML (rw) */
    Ifx_UReg_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_ERAY_NEMC_Bits;

